In [1]:
%load_ext sql

In [2]:
%sql sqlite://

In [3]:
%%sql

CREATE TABLE Worker (ID INT PRIMARY KEY  ,
                     First_Name VARCHAR (20) NOT NULL , 
                     Last_Name VARCHAR(20) , 
                     EMAIL varchar(50) ,
                     DEPARTMENT VARCHAR(20) NOT NULL , 
                     Salary INT , 
                     Join_Date DATE) ;

 * sqlite://
Done.

[]

In [4]:
%%sql

INSERT INTO Worker Values(1,'Vishal','Rathore','vishalrathore@ineuron.com','Finance', 45000,'2018-02-12');
INSERT INTO Worker Values(2,'Rahul','Sarathe','rahulsarathe@ineuron.com','HR', 60000,  '2017-04-17');
INSERT INTO Worker Values(3,'Anisha','Gour','anishagour@ineuron.com','Purchase', 30000, '2017-12-20');
INSERT INTO Worker Values(4,'Saksham','Mahajan','sakshammahajan@ineuron.com','Finance', 60000, '2019-11-12');
INSERT INTO Worker Values(5,'Aakash','Singh','amansingh@ineuron.com','Purchase',30000,  '2017-09-05');
INSERT INTO Worker Values(6,'Ankit','Kumar','ankitkumar@ineuron.com','Marketing', 50000,  '2020-01-14');
INSERT INTO Worker Values(7,'Riya','Agarwal','riyaagarwal@ineuron.com','Finance', 45000, '2018-04-23');
INSERT INTO Worker Values(8,'Nishit','Sharma','nishitsharma@ineuron.com','Purchase', 48000, '2018-10-10');
INSERT INTO Worker Values(9,'Samay','Raina','samayraina@ineuron.com','Marketing', 36000,  '2017-08-22');
INSERT INTO Worker Values(10,'Aman','Singh','amansingh@ineuron.com','Finance', 45000,  '2017-08-12');
INSERT INTO Worker Values(11,'Sarthak','Jain','sarthakjain@ineuron.com','Purchase', 48000,  '2018-04-08');
INSERT INTO Worker Values(12,'Ashutosh','Patil','ashutoshpatil@ineuron.com','PR', 50000,  '2019-09-26');
INSERT INTO Worker Values(13,'Harshit','Kumar','harshitkumar@ineuron.com','HR', 40000,  '2018-06-05');
INSERT INTO Worker Values(14,'Ayush','Srivastav','ayushsrivastav@ineuron.com','Purchase', 30000,  '2018-08-24');
INSERT INTO Worker Values(15,'Shreyansh','Deriya','shreyanshderiya@ineuron.com','PR', 35000, '2017-07-13');
INSERT INTO Worker Values(16,'Aryan','Sharma','aryansharma@ineuron.com','Finance', 60000,  '2019-10-31');
INSERT INTO Worker Values(17,'Snehal','Reddy','snehalreddy@ineuron.com','HR', 40000, '2019-03-28');
INSERT INTO Worker Values(18,'Shubham','Mittal','shubhammittal@ineuron.com','PR', 35000,'2020-02-01');
INSERT INTO Worker Values(19,'Rakshit','Rao','rakshitao@ineuron.com','Marketing', 36000, '2018-11-30');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%%sql

CREATE TABLE Worker_Clone as SELECT * FROM Worker;

 * sqlite://
Done.

[]

In [6]:
%%sql

insert  INTO Worker_Clone SELECT * FROM Worker;

 * sqlite://
19 rows affected.

[]

In [7]:
%%sql

INSERT INTO Worker_Clone Values(20,'anil','Rai','anilrai@ineuron.com','Finance', 45000,'2018-02-12');
INSERT INTO Worker_Clone Values(21,'Rosy','Surat','rosysurat@ineuron.com','HR', 60000,  '2017-04-17');
INSERT INTO Worker_Clone Values(22,'Amy','Syam','amysyam@ineuron.com','Purchase', 30000, '2017-12-20');
INSERT INTO Worker_Clone Values(23,'Sid','Mah','sidmah@ineuron.com','Finance', 60000, '2019-11-12');
INSERT INTO Worker_Clone Values(24,'Aarohi','Singh','aarohisingh@ineuron.com','Purchase',30000,  '2017-09-05');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [8]:
%%sql

select * from Worker
intersect
select * from Worker_Clone;

 * sqlite://
Done.

[(1, 'Vishal', 'Rathore', 'vishalrathore@ineuron.com', 'Finance', 45000, '2018-02-12'),
 (2, 'Rahul', 'Sarathe', 'rahulsarathe@ineuron.com', 'HR', 60000, '2017-04-17'),
 (3, 'Anisha', 'Gour', 'anishagour@ineuron.com', 'Purchase', 30000, '2017-12-20'),
 (4, 'Saksham', 'Mahajan', 'sakshammahajan@ineuron.com', 'Finance', 60000, '2019-11-12'),
 (5, 'Aakash', 'Singh', 'amansingh@ineuron.com', 'Purchase', 30000, '2017-09-05'),
 (6, 'Ankit', 'Kumar', 'ankitkumar@ineuron.com', 'Marketing', 50000, '2020-01-14'),
 (7, 'Riya', 'Agarwal', 'riyaagarwal@ineuron.com', 'Finance', 45000, '2018-04-23'),
 (8, 'Nishit', 'Sharma', 'nishitsharma@ineuron.com', 'Purchase', 48000, '2018-10-10'),
 (9, 'Samay', 'Raina', 'samayraina@ineuron.com', 'Marketing', 36000, '2017-08-22'),
 (10, 'Aman', 'Singh', 'amansingh@ineuron.com', 'Finance', 45000, '2017-08-12'),
 (11, 'Sarthak', 'Jain', 'sarthakjain@ineuron.com', 'Purchase', 48000, '2018-04-08'),
 (12, 'Ashutosh', 'Patil', 'ashutoshpatil@ineuron.com', 'PR', 50000, '2019-09-26'),
 (13, 'Harshit', 'Kumar', 'harshitkumar@ineuron.com', 'HR', 40000, '2018-06-05'),
 (14, 'Ayush', 'Srivastav', 'ayushsrivastav@ineuron.com', 'Purchase', 30000, '2018-08-24'),
 (15, 'Shreyansh', 'Deriya', 'shreyanshderiya@ineuron.com', 'PR', 35000, '2017-07-13'),
 (16, 'Aryan', 'Sharma', 'aryansharma@ineuron.com', 'Finance', 60000, '2019-10-31'),
 (17, 'Snehal', 'Reddy', 'snehalreddy@ineuron.com', 'HR', 40000, '2019-03-28'),
 (18, 'Shubham', 'Mittal', 'shubhammittal@ineuron.com', 'PR', 35000, '2020-02-01'),
 (19, 'Rakshit', 'Rao', 'rakshitao@ineuron.com', 'Marketing', 36000, '2018-11-30')]

##Q-2. Write an SQL query to sho records from one table that another table does not have.

In [12]:
%%sql

with t1 as (select w.ID from Worker w left join Worker_Clone wc on w.ID=wc.ID)
select * from Worker_Clone 
where ID NOT IN (select * from t1);

 * sqlite://
Done.

[(20, 'anil', 'Rai', 'anilrai@ineuron.com', 'Finance', 45000, '2018-02-12'),
 (21, 'Rosy', 'Surat', 'rosysurat@ineuron.com', 'HR', 60000, '2017-04-17'),
 (22, 'Amy', 'Syam', 'amysyam@ineuron.com', 'Purchase', 30000, '2017-12-20'),
 (23, 'Sid', 'Mah', 'sidmah@ineuron.com', 'Finance', 60000, '2019-11-12'),
 (24, 'Aarohi', 'Singh', 'aarohisingh@ineuron.com', 'Purchase', 30000, '2017-09-05')]